// zadanie.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>


#include <iostream>
    using namespace std;

    

    int main() {
        int a, b, c, d, e, f, g, j, m, q, w, t, k;
        setlocale(0, "");
        cout << "1 вопрос:\n" << endl; 
        cout << "1 Кто из этих персонажей не дружит с Гарри Поттером? " << endl;
        cout << "[1]" << "Невилл Лонгботтом" << endl;
        cout << "[2]" << "Драко Малфой" << endl;
        cout << "[3]" << " Гермиона Грейнджер" << endl;
        cout << "Введите ответ ";
        cin >> a;
        if (a == 3)
        {

            cout << "ответ правильный";

        }
        else if (a != 3)
        {

            cout << "ответ не правильный";

        }
        cout << endl;

        cout << "2 вопрос:\n" << endl; 
        cout << "2 Какое животное не фигурирует в китайском зодиаке? " << endl;
        cout << "[1]" << "Дракон" << endl;
        cout << "[2]" << "Кролик" << endl;
        cout << "[3]" << "Собака" << endl;
        cout << "Введите ответ: ";
        cin >> b;
        if (b == 1)
        {

            cout << "ответ правильный";

        }
        else if (b != 1)
        {

            cout << "ответ не правильный";

        }
        cout << endl;

        cout << "3 вопрос\n" << endl; 
      
        cout << "3 В какой стране проходили летние Олимпийские игры 2016 года?" << endl;
        cout << "[1]" << "Китай " << endl;
        cout << "[2]" << "Ирландия" << endl;
        cout << "[3]" << "Бразилия" << endl;
        cout << "Введите ответ: ";
        cin >> c;
        if (c == 2)
        {

            cout << "ответ правильный";

        }
        else if (c != 2)
        {

            cout << "ответ не правильный";

        }
        cout << endl;

        cout << "4 вопрос\n" << endl; 
        cout << "4 Какая планета самая горячая? " << endl;
        cout << "[1]" << "Венера" << endl;
        cout << "[2]" << "Сатурн" << endl;
        cout << "[3]" << "Меркурий" << endl;
        cout << "Введите ответ: ";
        cin >> d;
        if (d == 3)
        {

            cout << "ответ правильный";

        }
        else if (d != 3)
        {

            cout << "ответ не правильный";

        }
        cout << endl;

        cout << "5 вопрос\n" << endl; 
        cout << "5  Как назывался корабль капитана Джека Воробья в Пиратах Карибского моря? " << endl;
        cout << "[1]" << "Мародер " << endl;
        cout << "[2]" << "Черная жемчужина" << endl;
        cout << "[3]" << "Слизерин" << endl;
        cout << "Введите ответ: ";
        cin >> e;
        if (e == 2)
        {

            cout << "ответ правильный";

        }
        else if (e != 2)
        {

            cout << "ответ не правильный";

        }
        cout << endl;

        cout << "6 вопрос\n" << endl; 
        cout << "6 Какая самая редкая группа крови?" << endl;
        cout << "[1]" << " I группа " << endl;
        cout << "[2]" << "II группа" << endl;
        cout << "[3]" << " III группа" << endl;
        cout << "Введите ответ: ";
        cin >> f;
        if (f == 1)
        {

            cout << "ответ правильный";

        }
        else if (f != 1)
        {

            cout << "ответ не правильный";

        }
        cout << endl;

        cout << "7 вопрос\n" << endl;
        cout << "7 Сколько костей в теле человека? " << endl;
        cout << "[1]" << "206 " << endl;
        cout << "[2]" << "205" << endl;
        cout << "[3]" << "209" << endl;
        cout << "Введите ответ: ";
        cin >> g;
        if (g == 1)
        {

            cout << "ответ правильный";

        }
        else if (g != 1)
        {

            cout << "ответ не правильный";

        }
        cout << endl;

        cout << "8 вопрос\n" << endl;
        cout << "8 Fe — это символ какого химического элемента?" << endl;
        cout << "[1]" << "Цинк" << endl;
        cout << "[2]" << "Водород" << endl;
        cout << "[3]" << "Железо" << endl;
        cout << "Введите ответ: ";
        cin >> j;
        if (j == 3)
        {

            cout << "ответ правильный";

        }
        else if (j != 3)
        {

            cout << "ответ не правильный";

        }
        cout << endl;

        cout << "9 вопрос\n" << endl;
        cout << "9 Сколько сердец у осьминога?" << endl;
        cout << "[1]" << "1" << endl;
        cout << "[2]" << "3" << endl;
        cout << "[3]" << "2" << endl;
        cout << "Введите ответ: ";
        cin >> m;
        if (m == 1)
        {

            cout << "ответ правильный";

        }
        else if (m != 1)
        {

            cout << "ответ не правильный";

        }
        cout << endl;

        cout << "10 вопрос\n" << endl; 
        cout << "10 Кто расписывал потолок Сикстинской капеллы?" << endl;
        cout << "[1]" << "Леонардо Да Винчи" << endl;
        cout << "[2]" << "Пабло Пикассо" << endl;
        cout << "[3]" << "Василия Кандинского" << endl;
        cout << "Введите ответ: ";
        cin >> q;
        if (q == 2)
        {

            cout << "ответ правильный";

        }
        else if (q != 2)
        {

            cout << "ответ не правильный";

        }
        cout << endl;

        cout << "11 вопрос\n" << endl; 
        cout << "11 Какой океан самый большой на Земле?" << endl;
        cout << "[1]" << "Индийский" << endl;
        cout << "[2]" << "Тихий" << endl;
        cout << "[3]" << "Южный" << endl;
        cout << "Введите ответ: ";
        cin >> w;
        if (w == 2)
        {

            cout << "ответ правильный";

        }
        else if (w != 2)
        {

            cout << "ответ не правильный";

        }
        cout << endl;

        cout << "12 вопрос\n" << endl; 
        cout << "12 Кто нарисовал Мону Лизу?" << endl;
        cout << "[1]" << " Винсент Ван Гог " << endl;
        cout << "[2]" << " Леонардо да Винчи" << endl;
        cout << "[3]" << "Пабло Пикассо " << endl;
        cout << "Введите ответ: ";
        cin >> t;
        if (t == 1)
        {

            cout << "ответ правильный";

        }
        else if (t != 1)
        {

            cout << "ответ не правильный";

        }
        cout << endl;


        cout << "13 вопрос\n" << endl; 
        cout << "13 сколько часов я сегодня поспал?" << endl;
        cout << "[1]" << "6 " << endl;
        cout << "[2]" << "5" << endl;
        cout << "[3]" << "9" << endl;
        cout << "Введите ответ: ";
        cin >> k;
        if (k == 3)
        {

            cout << "ответ правильный";

        }

        cout << "12 вопрос\n" << endl;
        cout << "12 Кто нарисовал Мону Лизу?" << endl;
        cout << "[1]" << " Винсент Ван Гог " << endl;
        cout << "[2]" << " Леонардо да Винчи" << endl;
        cout << "[3]" << "Пабло Пикассо " << endl;
        cout << "Введите ответ: ";
        cin >> t;
        if (t == 1)
        {

            cout << "ответ правильный";

        }
        else if (t != 1)
        {

            cout << "ответ не правильный";

        }
        cout << endl;
        cout << "12 вопрос\n" << endl;
        cout << "12 Кто нарисовал Мону Лизу?" << endl;
        cout << "[1]" << " Винсент Ван Гог " << endl;
        cout << "[2]" << " Леонардо да Винчи" << endl;
        cout << "[3]" << "Пабло Пикассо " << endl;
        cout << "Введите ответ: ";
        cin >> t;
        if (t == 1)
        {

            cout << "ответ правильный";

        }
        else if (t != 1)
        {

            cout << "ответ не правильный";

        }
        cout << endl;
        cout << "12 вопрос\n" << endl;
        cout << "12 Кто нарисовал Мону Лизу?" << endl;
        cout << "[1]" << " Винсент Ван Гог " << endl;
        cout << "[2]" << " Леонардо да Винчи" << endl;
        cout << "[3]" << "Пабло Пикассо " << endl;
        cout << "Введите ответ: ";
        cin >> t;
        if (t == 1)
        {

            cout << "ответ правильный";

        }
        else if (t != 1)
        {

            cout << "ответ не правильный";

        }
        cout << endl;
        cout << "12 вопрос\n" << endl;
        cout << "12 Кто нарисовал Мону Лизу?" << endl;
        cout << "[1]" << " Винсент Ван Гог " << endl;
        cout << "[2]" << " Леонардо да Винчи" << endl;
        cout << "[3]" << "Пабло Пикассо " << endl;
        cout << "Введите ответ: ";
        cin >> t;
        if (t == 1)
        {

            cout << "ответ правильный";

        }
        else if (t != 1)
        {

            cout << "ответ не правильный";

        }
        cout << endl;
        cout << "12 вопрос\n" << endl;
        cout << "12 Кто нарисовал Мону Лизу?" << endl;
        cout << "[1]" << " Винсент Ван Гог " << endl;
        cout << "[2]" << " Леонардо да Винчи" << endl;
        cout << "[3]" << "Пабло Пикассо " << endl;
        cout << "Введите ответ: ";
        cin >> t;
        if (t == 1)
        {

            cout << "ответ правильный";

        }
        else if (t != 1)
        {

            cout << "ответ не правильный";

        }
        cout << endl;
        cout << "12 вопрос\n" << endl;
        cout << "12 Кто нарисовал Мону Лизу?" << endl;
        cout << "[1]" << " Винсент Ван Гог " << endl;
        cout << "[2]" << " Леонардо да Винчи" << endl;
        cout << "[3]" << "Пабло Пикассо " << endl;
        cout << "Введите ответ: ";
        cin >> t;
        if (t == 1)
        {

            cout << "ответ правильный";

        }
        else if (t != 1)
        {

            cout << "ответ не правильный";

        }
        cout << endl;
        cout << "12 вопрос\n" << endl;
        cout << "12 Кто нарисовал Мону Лизу?" << endl;
        cout << "[1]" << " Винсент Ван Гог " << endl;
        cout << "[2]" << " Леонардо да Винчи" << endl;
        cout << "[3]" << "Пабло Пикассо " << endl;
        cout << "Введите ответ: ";
        cin >> t;
        if (t == 1)
        {

            cout << "ответ правильный";

        }
        else if (t != 1)
        {

            cout << "ответ не правильный";

        }
        cout << endl;
        cout << "12 вопрос\n" << endl;
        cout << "12 Кто нарисовал Мону Лизу?" << endl;
        cout << "[1]" << " Винсент Ван Гог " << endl;
        cout << "[2]" << " Леонардо да Винчи" << endl;
        cout << "[3]" << "Пабло Пикассо " << endl;
        cout << "Введите ответ: ";
        cin >> t;
        if (t == 1)
        {

            cout << "ответ правильный";

        }
        else if (t != 1)
        {

            cout << "ответ не правильный";

        }
        cout << endl;
        cout << "12 вопрос\n" << endl;
        cout << "12 Кто нарисовал Мону Лизу?" << endl;
        cout << "[1]" << " Винсент Ван Гог " << endl;
        cout << "[2]" << " Леонардо да Винчи" << endl;
        cout << "[3]" << "Пабло Пикассо " << endl;
        cout << "Введите ответ: ";
        cin >> t;
        if (t == 1)
        {

            cout << "ответ правильный";

        }
        else if (t != 1)
        {

            cout << "ответ не правильный";

        }
        cout << endl;
        cout << "12 вопрос\n" << endl;
        cout << "12 Кто нарисовал Мону Лизу?" << endl;
        cout << "[1]" << " Винсент Ван Гог " << endl;
        cout << "[2]" << " Леонардо да Винчи" << endl;
        cout << "[3]" << "Пабло Пикассо " << endl;
        cout << "Введите ответ: ";
        cin >> t;
        if (t == 1)
        {

            cout << "ответ правильный";

        }
        else if (t != 1)
        {

            cout << "ответ не правильный";

        }
        cout << endl;
        cout << "12 вопрос\n" << endl;
        cout << "12 Кто нарисовал Мону Лизу?" << endl;
        cout << "[1]" << " Винсент Ван Гог " << endl;
        cout << "[2]" << " Леонардо да Винчи" << endl;
        cout << "[3]" << "Пабло Пикассо " << endl;
        cout << "Введите ответ: ";
        cin >> t;
        if (t == 1)
        {

            cout << "ответ правильный";

        }
        else if (t != 1)
        {

            cout << "ответ не правильный";

        }
        cout << endl;
        cout << "12 вопрос\n" << endl;
        cout << "12 Кто нарисовал Мону Лизу?" << endl;
        cout << "[1]" << " Винсент Ван Гог " << endl;
        cout << "[2]" << " Леонардо да Винчи" << endl;
        cout << "[3]" << "Пабло Пикассо " << endl;
        cout << "Введите ответ: ";
        cin >> t;
        if (t == 1)
        {

            cout << "ответ правильный";

        }
        else if (t != 1)
        {

            cout << "ответ не правильный";

        }
        cout << endl;
        cout << "12 вопрос\n" << endl;
        cout << "12 Кто нарисовал Мону Лизу?" << endl;
        cout << "[1]" << " Винсент Ван Гог " << endl;
        cout << "[2]" << " Леонардо да Винчи" << endl;
        cout << "[3]" << "Пабло Пикассо " << endl;
        cout << "Введите ответ: ";
        cin >> t;
        if (t == 1)
        {

            cout << "ответ правильный";

        }
        else if (t != 1)
        {

            cout << "ответ не правильный";

        }
        cout << endl;
        cout << "12 вопрос\n" << endl;
        cout << "12 Кто нарисовал Мону Лизу?" << endl;
        cout << "[1]" << " Винсент Ван Гог " << endl;
        cout << "[2]" << " Леонардо да Винчи" << endl;
        cout << "[3]" << "Пабло Пикассо " << endl;
        cout << "Введите ответ: ";
        cin >> t;
        if (t == 1)
        {

            cout << "ответ правильный";

        }
        else if (t != 1)
        {

            cout << "ответ не правильный";

        }
        cout << endl;
        cout << "12 вопрос\n" << endl;
        cout << "12 Кто нарисовал Мону Лизу?" << endl;
        cout << "[1]" << " Винсент Ван Гог " << endl;
        cout << "[2]" << " Леонардо да Винчи" << endl;
        cout << "[3]" << "Пабло Пикассо " << endl;
        cout << "Введите ответ: ";
        cin >> t;
        if (t == 1)
        {

            cout << "ответ правильный";

        }
        else if (t != 1)
        {

            cout << "ответ не правильный";

        }
        cout << endl;
        cout << "12 вопрос\n" << endl;
        cout << "12 Кто нарисовал Мону Лизу?" << endl;
        cout << "[1]" << " Винсент Ван Гог " << endl;
        cout << "[2]" << " Леонардо да Винчи" << endl;
        cout << "[3]" << "Пабло Пикассо " << endl;
        cout << "Введите ответ: ";
        cin >> t;
        if (t == 1)
        {

            cout << "ответ правильный";

        }
        else if (t != 1)
        {

            cout << "ответ не правильный";

        }
        cout << endl;
        cout << "12 вопрос\n" << endl;
        cout << "12 Кто нарисовал Мону Лизу?" << endl;
        cout << "[1]" << " Винсент Ван Гог " << endl;
        cout << "[2]" << " Леонардо да Винчи" << endl;
        cout << "[3]" << "Пабло Пикассо " << endl;
        cout << "Введите ответ: ";
        cin >> t;
        if (t == 1)
        {

            cout << "ответ правильный";

        }
        else if (t != 1)
        {

            cout << "ответ не правильный";

        }
        cout << endl;

    }
    //извините, мне лень писать 30 вопросов, я уже понял как это работает @_@